# Создание базы данных 
---
***Цель проекта*** заключается в создании базы данных в PostgreSQL, формировании таблиц и загрузке данных из CSV-файлов, с последующей визуализацией данных в дашборд

***Стадия решения проекта:*** 
- Чтение csv-файлов и преобразование их в датафреймы
- Очистка и обработка полученных данных
- Создание базы данных в PostgreSQL
- Создание таблиц в базе данных 
- Заполнение таблиц данными из датафреймов
- Визуализация данных из PostgreSQL

In [1]:
# Импортируем необходимые библиотеки для работы с csv-файлами
import pandas as pd 
import numpy as np

In [2]:
# Прочитаем csv-файлы и отредактируем все полученные датафреймы
df_country = pd.read_csv('Wealth-AccountsCountry.csv')
df_data = pd.read_csv('Wealth-AccountData.csv')
df_series = pd.read_csv('Wealth-AccountSeries.csv')

In [3]:
df_country.head()

,Code,Long Name,Income Group,Region,Lending category,Other groups,Currency Unit,Latest population census,Latest household survey,Special Notes,...,Source of most recent Income and expenditure data,Vital registration complete,Latest agricultural census,Latest industrial data,Latest trade data,Latest water withdrawal data,2-alpha code,WB-2 code,Table Name,Short Name
0,ALB,Republic of Albania,Upper middle income,Europe & Central Asia,IBRD,NaN,Albanian lek,2020 (expected),"Demographic and Health Survey, 2017/18",NaN,...,Living Standards Measurement Study Survey (LSM...,Yes,2012,2013.0,2018.0,2006.0,AL,AL,Albania,Albania
1,ARG,Argentine Republic,Upper middle income,Latin America & Caribbean,IBRD,NaN,Argentine peso,2020 (expected),"Multiple Indicator Cluster Survey, 2019/20",NaN,...,"Integrated household survey (IHS), 2016",Yes,2008,2002.0,2018.0,2011.0,AR,AR,Argentina,Argentina
2,ARM,Republic of Armenia,Upper middle income,Europe & Central Asia,IBRD,NaN,Armenian dram,2020 (expected),"Demographic and Health Survey, 2015/16",NaN,...,"Integrated household survey (IHS), 2016",Yes,2014,NaN,2018.0,2012.0,AM,AM,Armenia,Armenia
3,AUS,Commonwealth of Australia,High income,East Asia & Pacific,NaN,NaN,Australian dollar,2016,NaN,Fiscal year end: June 30; reporting period for...,...,"Expenditure survey/budget survey (ES/BS), 2010",Yes,2015-2016,2013.0,2018.0,2013.0,AU,AU,Australia,Australia
4,AUT,Republic of Austria,High income,Europe & Central Asia,NaN,Euro area,Euro,2011. Population figures compiled from adminis...,NaN,A simple multiplier is used to convert the nat...,...,"Income survey (IS), 2015",Yes,2010,2014.0,2018.0,2010.0,AT,AT,Austria,Austria

In [4]:
# Оставим только нужные колонки
df_country = df_country[['Code','Long Name','Short Name','Region','Income Group','Currency Unit']]
df_country.head()

,Code,Long Name,Short Name,Region,Income Group,Currency Unit
0,ALB,Republic of Albania,Albania,Europe & Central Asia,Upper middle income,Albanian lek
1,ARG,Argentine Republic,Argentina,Latin America & Caribbean,Upper middle income,Argentine peso
2,ARM,Republic of Armenia,Armenia,Europe & Central Asia,Upper middle income,Armenian dram
3,AUS,Commonwealth of Australia,Australia,East Asia & Pacific,High income,Australian dollar
4,AUT,Republic of Austria,Austria,Europe & Central Asia,High income,Euro

In [5]:
# Выведем информацию о датафрейме
df_country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7597 entries, 0 to 7596
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Code           7592 non-null   object
 1   Long Name      7594 non-null   object
 2   Short Name     146 non-null    object
 3   Region         146 non-null    object
 4   Income Group   7593 non-null   object
 5   Currency Unit  146 non-null    object
dtypes: object(6)
memory usage: 356.2+ KB

In [6]:
# Видем количество пропусков
df_country.isna().sum()

Code                5
Long Name           3
Short Name       7451
Region           7451
Income Group        4
Currency Unit    7451
dtype: int64

In [7]:
# Заметно большое количество пропущенных значений в колонкаx ['Short Name','Region','Currency Unit']
# Посмотрим количество уникальных значений в колонке 'Code' , так как в дальнейшем имеено она будет
# выступать в качестве Primary key
df_country['Code'].nunique()

146

In [8]:
# Количество уникальных значений совпадает с количеством значений в столбцах ['Short Name','Region','Currency Unit']
# Посмотрим на даныые, допустим, когда в колонке 'Short Name' пропущены данные
df_country[df_country['Short Name'].isna()].head()

    Code Long Name Short Name Region Income Group Currency Unit
146  ARM   Armenia        NaN    NaN      Armenia           NaN
147  ARM   Armenia        NaN    NaN      Armenia           NaN
148  ARM   Armenia        NaN    NaN      Armenia           NaN
149  ARM   Armenia        NaN    NaN      Armenia           NaN
150  ARM   Armenia        NaN    NaN      Armenia           NaN

In [9]:
# Можно увидеть, что строки данных повоторяются и имеют большое количество пропусков
# Удалим их
df_country.dropna(subset=['Short Name'], inplace = True)

In [10]:
df_country.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146 entries, 0 to 145
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Code           146 non-null    object
 1   Long Name      146 non-null    object
 2   Short Name     146 non-null    object
 3   Region         146 non-null    object
 4   Income Group   145 non-null    object
 5   Currency Unit  146 non-null    object
dtypes: object(6)
memory usage: 8.0+ KB

In [11]:
# Посмотрим где у нас пропущено значение из колонки 'Income Group'
df_country[df_country['Income Group'].isna()]

,Code,Long Name,Short Name,Region,Income Group,Currency Unit
140,VEN,República Bolivariana de Venezuela,Venezuela,Latin America & Caribbean,NaN,Venezuelan bolivar fuerte

In [12]:
# Воспользуемся дополнительной информацией и заполним пропуск на основе списка стран по номинальному ВВП на душу населения(2021)
# В списке от МВФ Венесуэла занимает 151 место. Ближайшими странами в списке являются Камерун и Сенегал
df_country[(df_country['Short Name'] == 'Senegal') | (df_country['Short Name'] == 'Cameroon')]

,Code,Long Name,Short Name,Region,Income Group,Currency Unit
20,CMR,Republic of Cameroon,Cameroon,Sub-Saharan Africa,Lower middle income,Central African CFA franc
113,SEN,Republic of Senegal,Senegal,Sub-Saharan Africa,Lower middle income,West African CFA franc

In [13]:
# Заполним пропущенное значение
df_country.loc[df_country['Short Name'] == 'Venezuela','Income Group'] = 'Lower middle income'

In [14]:
df_country.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146 entries, 0 to 145
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Code           146 non-null    object
 1   Long Name      146 non-null    object
 2   Short Name     146 non-null    object
 3   Region         146 non-null    object
 4   Income Group   146 non-null    object
 5   Currency Unit  146 non-null    object
dtypes: object(6)
memory usage: 8.0+ KB

***Мы закончили отчистку df_country, теперь перейдем к следующему датафрейму(df_data), в котором находятся данные показатей стран с 1995 по 2018 гг.***

In [15]:
df_data.head()

,Country Name,Country Code,Series Name,Series Code,1995 [YR1995],1996 [YR1996],1997 [YR1997],1998 [YR1998],1999 [YR1999],2000 [YR2000],...,2009 [YR2009],2010 [YR2010],2011 [YR2011],2012 [YR2012],2013 [YR2013],2014 [YR2014],2015 [YR2015],2016 [YR2016],2017 [YR2017],2018 [YR2018]
0,Albania,ALB,Human capital (constant 2018 US$),NW.HCA.TO,4.49E+10,4.34E+10,3.71E+10,3.88E+10,4.22E+10,4.36E+10,...,6.610000e+10,6.810000e+10,6.850000e+10,7.080000e+10,7.160000e+10,7.250000e+10,7.370000e+10,7.57E+10,7.80E+10,8.12E+10
1,Albania,ALB,Human capital per capita (constant 2018 US$),NW.HCA.PC,14072.79,13708.99,11794.1,12399.48,13573.26,14118.13,...,2.258200e+04,2.336286e+04,2.359058e+04,2.439397e+04,2.473162e+04,2.509002e+04,2.559371e+04,26326.26,27160.86,28333.68
2,Albania,ALB,"Human capital per capita, employed female (con...",NW.HCA.FEMP.PC,3468.858,3355.549,2868.997,3013.391,3259.893,3424.007,...,2.825336e+03,2.889150e+03,2.848523e+03,2.930234e+03,2.954273e+03,2.957420e+03,2.987545e+03,3072.504,3178.417,3312.927
3,Albania,ALB,"Human capital per capita, employed male (const...",NW.HCA.MEMP.PC,6507.931,6353.737,5466.692,5901.072,6492.73,6872.019,...,1.525319e+04,1.578992e+04,1.579854e+04,1.647360e+04,1.681013e+04,1.699138e+04,1.730701e+04,17817.1,18445.94,19245.19
4,Albania,ALB,"Human capital per capita, female (constant 201...",NW.HCA.FEMA.PC,4893.006,4737.857,4059.321,4191.445,4536.972,4695.071,...,3.529144e+03,3.613606e+03,3.603694e+03,3.683810e+03,3.696744e+03,3.719608e+03,3.767628e+03,3872.142,3992.188,4161.137

In [16]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7592 entries, 0 to 7591
Data columns (total 28 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Country Name   7592 non-null   object
 1   Country Code   7592 non-null   object
 2   Series Name    7592 non-null   object
 3   Series Code    7592 non-null   object
 4   1995 [YR1995]  7592 non-null   object
 5   1996 [YR1996]  7592 non-null   object
 6   1997 [YR1997]  7592 non-null   object
 7   1998 [YR1998]  7592 non-null   object
 8   1999 [YR1999]  7592 non-null   object
 9   2000 [YR2000]  7592 non-null   object
 10  2001 [YR2001]  7592 non-null   object
 11  2002 [YR2002]  7592 non-null   object
 12  2003 [YR2003]  7592 non-null   object
 13  2004 [YR2004]  7592 non-null   object
 14  2005 [YR2005]  7592 non-null   float64
 15  2006 [YR2006]  7592 non-null   float64
 16  2007 [YR2007]  7592 non-null   float64
 17  2008 [YR2008]  7592 non-null   float64
 18  2009 [YR2009]  7592 non-null   float64
 19  2010 [YR2010]  7592 non-null   float64
 20  2011 [YR2011]  7592 non-null   float64
 21  2012 [YR2012]  7592 non-null   float64
 22  2013 [YR2013]  7592 non-null   float64
 23  2014 [YR2014]  7592 non-null   float64
 24  2015 [YR2015]  7592 non-null   float64
 25  2016 [YR2016]  7592 non-null   object
 26  2017 [YR2017]  7592 non-null   object
 27  2018 [YR2018]  7592 non-null   object
dtypes: float64(11), object(17)
memory usage: 1.6+ MB

In [17]:
# Создадим словарь, чтобы переимновать колонки с 1995 по 2018 год 
year_columns = {}
for year in range(1995, 2019):
    old_column_name = f'{year} [YR{year}]'
    new_column_name = f'year_{year}'
    year_columns[old_column_name] = new_column_name
    
# Переименуем колонки и удалим ненужные
df_data.rename(columns = year_columns, inplace = True)
df_data.drop('Series Name', axis = 1, inplace = True)

# Изменим тип данных в колонках с 1995 по 2018 
for column_number in range(3,27):
    df_data.iloc[:,column_number] = pd.to_numeric(df_data.iloc[:,column_number], errors = 'coerce')
    
df_data.head()

C:\Users\Мотян\AppData\Local\Temp\ipykernel_11124\2992353002.py:14: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df_data.iloc[:,column_number] = pd.to_numeric(df_data.iloc[:,column_number], errors = 'coerce')

,Country Name,Country Code,Series Code,year_1995,year_1996,year_1997,year_1998,year_1999,year_2000,year_2001,...,year_2009,year_2010,year_2011,year_2012,year_2013,year_2014,year_2015,year_2016,year_2017,year_2018
0,Albania,ALB,NW.HCA.TO,4.490000e+10,4.340000e+10,3.710000e+10,3.880000e+10,4.220000e+10,4.360000e+10,4.760000e+10,...,6.610000e+10,6.810000e+10,6.850000e+10,7.080000e+10,7.160000e+10,7.250000e+10,7.370000e+10,7.570000e+10,7.800000e+10,8.120000e+10
1,Albania,ALB,NW.HCA.PC,1.407279e+04,1.370899e+04,1.179410e+04,1.239948e+04,1.357326e+04,1.411813e+04,1.556446e+04,...,2.258200e+04,2.336286e+04,2.359058e+04,2.439397e+04,2.473162e+04,2.509002e+04,2.559371e+04,2.632626e+04,2.716086e+04,2.833368e+04
2,Albania,ALB,NW.HCA.FEMP.PC,3.468858e+03,3.355549e+03,2.868997e+03,3.013391e+03,3.259893e+03,3.424007e+03,3.783821e+03,...,2.825336e+03,2.889150e+03,2.848523e+03,2.930234e+03,2.954273e+03,2.957420e+03,2.987545e+03,3.072504e+03,3.178417e+03,3.312927e+03
3,Albania,ALB,NW.HCA.MEMP.PC,6.507931e+03,6.353737e+03,5.466692e+03,5.901072e+03,6.492730e+03,6.872019e+03,7.607771e+03,...,1.525319e+04,1.578992e+04,1.579854e+04,1.647360e+04,1.681013e+04,1.699138e+04,1.730701e+04,1.781710e+04,1.844594e+04,1.924519e+04
4,Albania,ALB,NW.HCA.FEMA.PC,4.893006e+03,4.737857e+03,4.059321e+03,4.191445e+03,4.536972e+03,4.695071e+03,5.169876e+03,...,3.529144e+03,3.613606e+03,3.603694e+03,3.683810e+03,3.696744e+03,3.719608e+03,3.767628e+03,3.872142e+03,3.992188e+03,4.161137e+03

In [18]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7592 entries, 0 to 7591
Data columns (total 27 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  7592 non-null   object
 1   Country Code  7592 non-null   object
 2   Series Code   7592 non-null   object
 3   year_1995     7582 non-null   float64
 4   year_1996     7582 non-null   float64
 5   year_1997     7588 non-null   float64
 6   year_1998     7588 non-null   float64
 7   year_1999     7588 non-null   float64
 8   year_2000     7590 non-null   float64
 9   year_2001     7590 non-null   float64
 10  year_2002     7590 non-null   float64
 11  year_2003     7590 non-null   float64
 12  year_2004     7590 non-null   float64
 13  year_2005     7592 non-null   float64
 14  year_2006     7592 non-null   float64
 15  year_2007     7592 non-null   float64
 16  year_2008     7592 non-null   float64
 17  year_2009     7592 non-null   float64
 18  year_2010     7592 non-null   float64
 19  year_2011     7592 non-null   float64
 20  year_2012     7592 non-null   float64
 21  year_2013     7592 non-null   float64
 22  year_2014     7592 non-null   float64
 23  year_2015     7592 non-null   float64
 24  year_2016     7590 non-null   float64
 25  year_2017     7590 non-null   float64
 26  year_2018     7518 non-null   float64
dtypes: float64(24), object(3)
memory usage: 1.6+ MB

In [19]:
df_data.isna().sum()

Country Name     0
Country Code     0
Series Code      0
year_1995       10
year_1996       10
year_1997        4
year_1998        4
year_1999        4
year_2000        2
year_2001        2
year_2002        2
year_2003        2
year_2004        2
year_2005        0
year_2006        0
year_2007        0
year_2008        0
year_2009        0
year_2010        0
year_2011        0
year_2012        0
year_2013        0
year_2014        0
year_2015        0
year_2016        2
year_2017        2
year_2018       74
dtype: int64

In [20]:
# Видно, что пропущенные значения появились в колонках изначального типа 'object'
# Посмотрим, что там сейчас (должно быть Nan) и что было до этого
df_data[df_data['year_2018'].isna()].head()

,Country Name,Country Code,Series Code,year_1995,year_1996,year_1997,year_1998,year_1999,year_2000,year_2001,...,year_2009,year_2010,year_2011,year_2012,year_2013,year_2014,year_2015,year_2016,year_2017,year_2018
546,Belize,BLZ,NW.NCA.SAGA.PC,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
561,Belize,BLZ,NW.NCA.SAGA.TO,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
910,Burkina Faso,BFA,NW.NCA.SAGA.PC,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
925,Burkina Faso,BFA,NW.NCA.SAGA.TO,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
962,Burundi,BDI,NW.NCA.SAGA.PC,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN

In [21]:
# Создадим датафрейм для проверки, прочитав изначальный файл еще раз
df_proverka = pd.read_csv('Wealth-AccountData.csv')

In [22]:
# В прошлый раз там были две точки вместо числа, значит преобразование типа колонок выполнено верно
df_proverka[(df_proverka['Country Name'] =='Belize') & (df_proverka['Series Code'] == 'NW.NCA.SAGA.PC')][['2018 [YR2018]']]

    2018 [YR2018]
546            ..

In [23]:
# Заменим все 'Nan'-ы на 0 и выберем только нужные строки, где 
# сумма показателей с 1995 по 2018 не равна нулю
df_data.fillna(0, inplace=True)
df_data = df_data[df_data.iloc[:, 3:27].sum(axis=1) != 0]

In [24]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6792 entries, 0 to 7591
Data columns (total 27 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Name  6792 non-null   object
 1   Country Code  6792 non-null   object
 2   Series Code   6792 non-null   object
 3   year_1995     6792 non-null   float64
 4   year_1996     6792 non-null   float64
 5   year_1997     6792 non-null   float64
 6   year_1998     6792 non-null   float64
 7   year_1999     6792 non-null   float64
 8   year_2000     6792 non-null   float64
 9   year_2001     6792 non-null   float64
 10  year_2002     6792 non-null   float64
 11  year_2003     6792 non-null   float64
 12  year_2004     6792 non-null   float64
 13  year_2005     6792 non-null   float64
 14  year_2006     6792 non-null   float64
 15  year_2007     6792 non-null   float64
 16  year_2008     6792 non-null   float64
 17  year_2009     6792 non-null   float64
 18  year_2010     6792 non-null   float64
 19  year_2011     6792 non-null   float64
 20  year_2012     6792 non-null   float64
 21  year_2013     6792 non-null   float64
 22  year_2014     6792 non-null   float64
 23  year_2015     6792 non-null   float64
 24  year_2016     6792 non-null   float64
 25  year_2017     6792 non-null   float64
 26  year_2018     6792 non-null   float64
dtypes: float64(24), object(3)
memory usage: 1.5+ MB

***Мы закончили отчистку df_data, теперь перейдем к следующему датафрейму(df_series), в котором находятся данные о показателях, представленных в df_data***

In [25]:
df_series.head()

,Code,Indicator Name,Long definition,Source,Topic,Unit of measure,Periodicity,Reference period,Statistical concept and methodology,Previous Indicator Code,Previous Indicator Name
0,NW.HCA.TO,Human capital (constant 2018 US$),Human capital is computed as the present value...,World Bank. 2021. The Changing Wealth of Natio...,Human capital,Constant 2018 US$,Annual,1995-2018,Total wealth is calculated by summing up estim...,NaN,NaN
1,NW.HCA.PC,Human capital per capita (constant 2018 US$),Human capital is computed as the present value...,World Bank. 2021. The Changing Wealth of Natio...,Human capital,Constant 2018 US$,Annual,1995-2018,Total wealth is calculated by summing up estim...,NaN,NaN
2,NW.HCA.FEMP.PC,"Human capital per capita, employed female (con...",Human capital is computed as the present value...,World Bank. 2021. The Changing Wealth of Natio...,Human capital,Constant 2018 US$,Annual,1995-2018,Total wealth is calculated by summing up estim...,NaN,NaN
3,NW.HCA.MEMP.PC,"Human capital per capita, employed male (const...",Human capital is computed as the present value...,World Bank. 2021. The Changing Wealth of Natio...,Human capital,Constant 2018 US$,Annual,1995-2018,Total wealth is calculated by summing up estim...,NaN,NaN
4,NW.HCA.FEMA.PC,"Human capital per capita, female (constant 201...",Human capital is computed as the present value...,World Bank. 2021. The Changing Wealth of Natio...,Human capital,Constant 2018 US$,Annual,1995-2018,Total wealth is calculated by summing up estim...,NaN,NaN

In [26]:
# Оставим только нужные колонки
df_series = df_series[['Code','Indicator Name','Long definition','Topic']]
df_series.head()

,Code,Indicator Name,Long definition,Topic
0,NW.HCA.TO,Human capital (constant 2018 US$),Human capital is computed as the present value...,Human capital
1,NW.HCA.PC,Human capital per capita (constant 2018 US$),Human capital is computed as the present value...,Human capital
2,NW.HCA.FEMP.PC,"Human capital per capita, employed female (con...",Human capital is computed as the present value...,Human capital
3,NW.HCA.MEMP.PC,"Human capital per capita, employed male (const...",Human capital is computed as the present value...,Human capital
4,NW.HCA.FEMA.PC,"Human capital per capita, female (constant 201...",Human capital is computed as the present value...,Human capital

In [27]:
df_series.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Code             52 non-null     object
 1   Indicator Name   52 non-null     object
 2   Long definition  52 non-null     object
 3   Topic            52 non-null     object
dtypes: object(4)
memory usage: 1.8+ KB

In [28]:
df_series.isna().sum()

Code               0
Indicator Name     0
Long definition    0
Topic              0
dtype: int64

***Мы успешно завершили этапы работы, связанные с "Чтением csv-файлов и преобразованием их в датафреймы" и "Очисткой и обработкой полученных данных". Теперь можно перейти к выполнению оставшихся задач***

In [29]:
# Импортируем библиотеку необходимую для работы с PostreSQL
# !pip insall psycopg2
import psycopg2

In [30]:
# Создадим соединение с базам данных PostgreSQL
conn = psycopg2.connect('host=127.0.0.1 dbname=postgres user=postgres password=st0rich')
conn.set_session(autocommit = True)
cur = conn.cursor()

In [31]:
# Cоздадим базу данных 'accounts' 
# Но сначала удалим ее, если она уже сущетсвует
cur.execute("DROP DATABASE IF EXISTS accounts")
cur.execute("CREATE DATABASE accounts WITH ENCODING 'utf8'")

In [32]:
# Закроем соединение
conn.close()

In [33]:
# Подключимся к созданной базе данной 'accounts'
conn = psycopg2.connect('host=127.0.0.1 dbname=accounts user=postgres password=st0rich')
conn.set_session(autocommit = True)
cur = conn.cursor()

In [34]:
# Удалим таблицу, если она уже существует
cur.execute(
'''
DROP TABLE IF EXISTS country
'''
)
conn.commit()

In [35]:
# Создадим таблицу 'country', в которой в дальнейшем будут данные из df_country
cur.execute(
'''
CREATE TABLE IF NOT EXISTS country
(
country_code VARCHAR PRIMARY KEY,
long_name VARCHAR,
short_name VARCHAR,
region VARCHAR,
income_group VARCHAR,
currency_unit VARCHAR
)
'''
)
conn.commit()

In [36]:
# Аналогично для других таблиц
cur.execute(
'''
DROP TABLE IF EXISTS series
'''
)
conn.commit()

In [37]:
cur.execute(
'''
CREATE TABLE IF NOT EXISTS series
(
series_code VARCHAR,
indicator_name VARCHAR,
long_definition VARCHAR,
topic VARCHAR
)
'''
)
conn.commit()

In [38]:
cur.execute(
'''
DROP TABLE IF EXISTS data
'''
)
conn.commit()

In [39]:
# Напишем функцию, которая будет содержать строку для создания таблицы со всеми 
# переменными из df_data, так как переменных довольно много и это облегчит нам работу
def generate_create_table(df):
    create_table_query = '''
CREATE TABLE IF NOT EXISTS data
(
{}
)
'''
    columns = df.columns
    columns_sql = []

    for column in columns:
        if df[column].dtype == 'object':
            columns_sql.append(f'{column} VARCHAR')
        elif df[column].dtype == 'float64':
            columns_sql.append(f'{column} NUMERIC')

    return create_table_query.format(',\n'.join(columns_sql))

df_data.rename(columns = {'Country Name': 'country_name','Country Code' : 'country_code','Series Code' : 'series_code'}, inplace = True)
df_create_table = generate_create_table(df_data)

In [40]:
cur.execute(df_create_table)
conn.commit()

In [41]:
#Заполним построчно значения созданных таблиц
for i,row in df_country.iterrows():
    cur.execute(
    '''
    INSERT INTO country
    (country_code, long_name, short_name, region, income_group, currency_unit)
    VALUES (%s, %s, %s, %s, %s, %s)
    ''', row.tolist())
    conn.commit()

In [42]:
for i,row in df_series.iterrows():
    cur.execute(
    '''
    INSERT INTO series
    (series_code, indicator_name, long_definition, topic)
    VALUES (%s, %s, %s, %s)
    ''', row.tolist())
    conn.commit()

In [43]:
for i,row in df_data.iterrows():
    cur.execute(
    '''
    INSERT INTO data
    (country_name, country_code, series_code, year_1995, year_1996, year_1997, year_1998, year_1999, year_2000,
    year_2001, year_2002, year_2003, year_2004, year_2005, year_2006, year_2007, year_2008, year_2009, year_2010, 
    year_2011, year_2012, year_2013, year_2014, year_2015, year_2016, year_2017, year_2018)
    VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, 
    %s, %s)
    ''', row.tolist())
    conn.commit()

In [44]:
# Закроем соединение 
conn.close()

***Мы успешно завершили все этапы работы, которые требовали выполнения в Python. Теперь можно приступить к визуализации данных***

In [45]:
# !pip install ipython-sql
# Напишем магическую функция Jupyter, позволяющую работать с БД 'accounts' прямо из Jupyter Notebook
%load_ext sql

In [46]:
# Подключимся к базе данных 'accounts'
connection_string = "postgresql://postgres:st0rich@127.0.0.1/accounts"
%sql $connection_string

In [47]:
# Проверим корректность работы на простом запросе 
%sql select count(country_code) from country

 * postgresql://postgres:***@127.0.0.1/accounts
1 rows affected.

[(146,)]

In [48]:
# Все работает, отключаемся
%reload_ext sql